/* --------------------------------------------------------------------- */
/* Code Structure                                                        */
/* --------------------------------------------------------------------- */

// alt + shift + a : 캡션 영역 주석

// 한 줄 주석 (single line comment)
console.log('ECMAScript의 `문`은 어떠한 작업을 수행하는 문법 구조 및 명령을 의미합니다.');


// 세미콜론 (semicolons) + color blocks test {#f9e, 3}
console.log('다음 줄에서 코드를 작성 할 경우, 세미콜론을 붙인 것과 동일합니다.')
console.log('하지만 세미콜론을 명시적으로 추가할 것을 권장합니다.')

/*
여러 줄 (multi lines)
주석 (comment)
//   [중첩주석 테스트]
중첩주석 테스트
*/